<?php
 
 $books = array(
'451° по Фаренгейту',
'Шантарам',
'1984',
'Мастер и Маргарита',
'Три товарища',
'Портрет Дориана Грея',
'Вино из одуванчиков',
'Цветы для Элджернона',
'Над пропастью во ржи',
'Маленький принц',
'Анна Каренина',
'Сто лет одиночества',
'Тень горы',
'Атлант расправил плечи'
 );

 print('<ol>');
 foreach ($books as $value) {
 	print('<li>');
    print($value);
    print('</li>');
    print('<br>');
}
print('</ol>');

$books_authors = array(
	"Рей Брэдбери"=> "451° по Фаренгейту",
    "Грегори Дэвид Робертс" => "Шантарам",   
	"Джордж Оруэлл" => "1984",
    "Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
    "Эрих Мария Ремарк" => "Три товарища",
    "Оскар Уайльд" => "Портрет Дориана Грея",
    "Рей Брэдбери" => "Вино из одуванчиков"
);

foreach ($books_authors as $key => $value) {
    echo "{$key} => {$value} ";
    print_r('<br>');
}

?>
